# Parameter Type Id Rebar Crank At End Type Property

Source: https://www.revitapidocs.com/2026/7cda8351-a810-3a38-0724-95bd83553c7f.htm

---

| Parameter Type Id Rebar Crank At End Type Property |
| --- |

"Crank at End"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarCrankAtEndType { get; }
```

```
Public Shared ReadOnly Property RebarCrankAtEndType As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarCrankAtEndType {
	ForgeTypeId^ get ();
}
```

```
static member RebarCrankAtEndType : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace